# Removing duplicates

In [1]:
from pandas import DataFrame, Series

In [2]:
df = DataFrame({'col 1' : [1,2,2,4,5,5,7,7],
               'col 2': ['a', 'b', 'b', 'd', 'e', 'e', 'g', 'g'],
               'col 3': ['A', 'B', 'B', 'D', 'E', 'E', 'G', 'G']})
df

   col 1 col 2 col 3
0      1     a     A
1      2     b     B
2      2     b     B
3      4     d     D
4      5     e     E
5      5     e     E
6      7     g     G
7      7     g     G

In [3]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [4]:
# getting rows which are duplicated
dup_df = df.duplicated()
for dup in range(len(dup_df)):
    if dup_df[dup]:
        print(df.loc[dup])
# we got the same rows which are duplicate in the df

col 1    2
col 2    b
col 3    B
Name: 2, dtype: object
col 1    5
col 2    e
col 3    E
Name: 5, dtype: object
col 1    7
col 2    g
col 3    G
Name: 7, dtype: object

In [5]:
df_row_duplicates = df.drop_duplicates()
df_row_duplicates

   col 1 col 2 col 3
0      1     a     A
1      2     b     B
3      4     d     D
4      5     e     E
6      7     g     G

In [6]:
df1 = DataFrame({'col 1' : [1,2,2,4,5,5,7,8],
               'col 2': ['a', 'b', 'b', 'd', 'e', 'e', 'g', 'h'],
               'col 3': ['A', 'B', 'B', 'D', 'E', 'E', 'G', 'G']})
df1

   col 1 col 2 col 3
0      1     a     A
1      2     b     B
2      2     b     B
3      4     d     D
4      5     e     E
5      5     e     E
6      7     g     G
7      8     h     G

In [7]:
df1.drop_duplicates('col 3')
# as in col 3 GG is repeated so it was droped

   col 1 col 2 col 3
0      1     a     A
1      2     b     B
3      4     d     D
4      5     e     E
6      7     g     G

In [8]:
df1.drop_duplicates('col 2')
# in col 2 g h not duplicates so it was there

   col 1 col 2 col 3
0      1     a     A
1      2     b     B
3      4     d     D
4      5     e     E
6      7     g     G
7      8     h     G

# my use case

In [9]:
std_df = DataFrame({'reg id': [1,2,3,3,4,5,6,6,7],
                   'name': ['mahesh','nani','kalyan','mahesh','aaaa','bbbb','aaaa','cccc','aaaa'],
                   'marks' : [23,44,56,34,44,23,67,55,75]})
std_df

   reg id    name  marks
0       1  mahesh     23
1       2    nani     44
2       3  kalyan     56
3       3  mahesh     34
4       4    aaaa     44
5       5    bbbb     23
6       6    aaaa     67
7       6    cccc     55
8       7    aaaa     75

In [10]:
std_df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [11]:
print(std_df)
reg_dup = std_df.duplicated(['reg id'])
reg_dup

   reg id    name  marks
0       1  mahesh     23
1       2    nani     44
2       3  kalyan     56
3       3  mahesh     34
4       4    aaaa     44
5       5    bbbb     23
6       6    aaaa     67
7       6    cccc     55
8       7    aaaa     75

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
8    False
dtype: bool

In [12]:
# getting the reg_ids which are duplicated
for dup_id in range(len(std_df)):
    if reg_dup[dup_id]:
        print(std_df['reg id'][dup_id])
# reg nos 3 and 6 got duplicated 
# likewise we can do the same process for reamining

3
6

In [13]:
print(std_df)
name_dup = std_df.duplicated(['name'])

   reg id    name  marks
0       1  mahesh     23
1       2    nani     44
2       3  kalyan     56
3       3  mahesh     34
4       4    aaaa     44
5       5    bbbb     23
6       6    aaaa     67
7       6    cccc     55
8       7    aaaa     75

In [14]:
# Now we try to find duplicate names
for dup in range(len(name_dup)):
    if name_dup[dup]:
        print(std_df['name'][dup])

mahesh
aaaa
aaaa

In [15]:
print(std_df)
std_df.duplicated(['marks'])

   reg id    name  marks
0       1  mahesh     23
1       2    nani     44
2       3  kalyan     56
3       3  mahesh     34
4       4    aaaa     44
5       5    bbbb     23
6       6    aaaa     67
7       6    cccc     55
8       7    aaaa     75

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8    False
dtype: bool

In [16]:
unique_reg = std_df.drop_duplicates(['reg id'])
print(unique_reg)
print(unique_reg.count())

   reg id    name  marks
0       1  mahesh     23
1       2    nani     44
2       3  kalyan     56
4       4    aaaa     44
5       5    bbbb     23
6       6    aaaa     67
8       7    aaaa     75
reg id    7
name      7
marks     7
dtype: int64

In [17]:
unique_names = std_df.drop_duplicates(['name'])
print(unique_names)
print(unique_names.count())

   reg id    name  marks
0       1  mahesh     23
1       2    nani     44
2       3  kalyan     56
4       4    aaaa     44
5       5    bbbb     23
7       6    cccc     55
reg id    6
name      6
marks     6
dtype: int64

In [18]:
unique_marks = std_df.drop_duplicates(['marks'])
print(unique_marks)
print(unique_marks.count())

   reg id    name  marks
0       1  mahesh     23
1       2    nani     44
2       3  kalyan     56
3       3  mahesh     34
6       6    aaaa     67
7       6    cccc     55
8       7    aaaa     75
reg id    7
name      7
marks     7
dtype: int64

# The End